[
  {
    "start": 3.82,
    "end": 33.94,
    "text": "So now we are going to talk about classification of bryophytes. Bryophytes, they are divided into three classes. Coming to the first one, it is Hepaticopsida. Now, liverworts, they are known as members of Hepaticopsida. Second is Anthocerotopsida, and it includes hornworts and leafy members, they are included in this third class, that is Bryopsida. In this lecture, I will be talking about only these two classes, that is Hepaticopsida and Bryopsida. So"
  },
  {
    "start": 33.94,
    "end": 64.36,
    "text": "let's start with the first one, that is, Hepaticopsida, which includes liverworts. Now, if you talk about their plant body, you know that plant body is haploid, and this haploid body, it is known as gametophyte. Why it is known as gametophyte? Because it is specialized to form gametes. Now, two types of condition can be seen in the case of liverworts. Now, first, it may be thallos, as seen in Rickia and Marchantia, or it may be foliose,"
  },
  {
    "start": 64.36,
    "end": 94.48,
    "text": "and one good example for this is Porella. Now, look at it, this first condition, you can see that the plant body is flat. It is thallus-like, it is flat, it is dorsi-ventral. Now, if you talk about Marchantia, you will see such type of condition. Now, this figure, which I have shown you here, this is also of Marchantia. So it is, uh, flat. It is flat, it is dorsi-ventral. Now, on the lower surface, that is the ventral surface, you can see certain hair"
  },
  {
    "start": 94.48,
    "end": 124.7,
    "text": "like structure. Actually, these are not roots, these are rhizoids. So these are not true roots. They are root-like structure, which you call them as rhizoids. Now look at the branching pattern. Now, when body is branching, it is forming two branches. So whenever it is going to branch, means in Marchantia, when branching will occur, always two branches will be formed. That's why you're going to call this condition as dichotomous condition. Now, in the case of foliose condition, you will see"
  },
  {
    "start": 124.7,
    "end": 155.32,
    "text": "leaf-like structures. Please keep this in mind. These are not true leaves. These are leaf-like structures, and this condition is seen very well in Porella. Now, what is the arrangement of leaves? So this is stem-like structure. On the lower side, rhizoids are present, which are root-like structure. Now, how leaves, they are arranged? Now, leaf-like structures, they are arranged in two rows. Like this."
  },
  {
    "start": 155.32,
    "end": 185.36,
    "text": "So this is one row, this is second row. So here we have learned that in the case of liverworts, body may be thallos or foliose. In the case of thallos condition, there is dorsi-ventral body. It is closely oppressed to the substratum, and as in the case of Marchantia, dichotomous branching is there. Now, in foliose condition, you will see leaf-like structure present in two rows. Now, what do you call this leaf-like structure? I have"
  },
  {
    "start": 185.36,
    "end": 216.2,
    "text": "already talked about these in the previous lecture. These are known as phylloids. And stem-like structure, which is present, that is known as colloid. Now, rhizoids, they are present on the ventral surface. Now, these rhizoids, they are unicellular and they're unbranched. They're quite simple. Liverworts represent primitive, it is ancient group of bryophytes. Now, scales."
  },
  {
    "start": 216.2,
    "end": 246.56,
    "text": "Scales, they are also present on the ventral surface. Now, these rhizoids, they are unicellular, but you have to keep this in mind that on the ventral surface, scales which are present, they are multicellular, and these scales, they are also known as amphigastria. Now, these are present on the ventral surface, and what is their function? They prevent water loss, or you can simply say they help in water retention. Now, if a question is asked here, \"What is the ploidy of"
  },
  {
    "start": 246.56,
    "end": 276.82,
    "text": "phylloids, colloids, rhizoids or scales?\" then what you will say? Now, all these structures, they are present on the gametophyte. They are present on the haploid body, so all these structures, they are haploid in nature. They possess only one set of chromosomes. Now we have to talk about reproduction. Now, asexual reproduction in liverworts can occur through fragmentation or formation of these special structures, which are known as gemmae. Now, these"
  },
  {
    "start": 276.82,
    "end": 307.18,
    "text": "gemmae, they are very well seen in Marchantia. So we are going to study structure of gemmae in little bit of detail by taking example of Marchantia. Now, in Marchantia, can you see these cup-like structures? Yes, these cup-like structures, which are present on the upper surface, these structures, they are known as gemma cups. Now, if you have a closer view of this thallus, what you will see? That inside these cups, there are certain structures. Now, what are these?"
  },
  {
    "start": 307.18,
    "end": 337.52,
    "text": "These are buds. These are not sexual, these are asexual buds, and you call these asexual buds, they, as gemmae. So let's look at the structure of these asexual buds which are present inside these cups. Yes, here I am making one bud. Now, can you see a stalk? Yes, it possess a stalk. They are stalked structure. They have two lobes, bilobed condition, and you have to keep this in mind, just like scales,"
  },
  {
    "start": 337.52,
    "end": 349.66,
    "text": "these structures, they are multicellular, they are green. Now"
  },
  {
    "start": 349.66,
    "end": 379.85,
    "text": "look at the shape. They have eight shape, bilobed, and they have eight shape. Now, generally, you know that one bud, it has the ability to form one plant body, but here, very peculiar feature is there, that this one asexual bud, after detachment from the thallus, it has the ability to form two thalli. Yes, one thalli, one thallus will be formed from this knob-...the thallus"
  },
  {
    "start": 379.85,
    "end": 410.05,
    "text": "will be formed from this notch. So this one asexual bud, it has the ability to form two thalli under favorable condition. This is one peculiar feature which is associated with these gemmae. So what we have learned about these structures? These structures, they are multicellular, asexual buds, bilobed, stalked, green, and surely they are part of gametophytic body, so they are haploid in nature. Now,"
  },
  {
    "start": 410.05,
    "end": 440.55,
    "text": "after this, now we are going to talk about sex organs, which are formed in liverworts. You know that in all the bryophytes sex organs, they are multicellular and jacketed. They are present on gametophyte. Yes, they are present on haploid bodies, so these sex organs, they are haploid in nature. Now, what do you call male sex organ as? Male sex organ is known as antheridium. It is club shape or rounded and stalk. Can you see this jacket? Yes, this is sterile"
  },
  {
    "start": 440.55,
    "end": 470.79,
    "text": "jacket. I've told you just now, they have multicellular and jacketed sex organs, and this jacket which is present, it is sterile, means it is not involved in the formation of any gamete. Gamete would be formed by the cells which are present here, and these cells, they are known as androconial cells. Now, coming to female sex organ, female sex organ is known as archegonium. It is flask shape. This lower part, which is swollen, this is venter. This tubular part is known as neck,"
  },
  {
    "start": 470.79,
    "end": 501.35,
    "text": "and inside venter, there is presence of only one egg, one non-motile female gamete is there, and inside antheridium, several motile male gametes, they are formed. I have already talked about all these feature while discussing general characters of bryophytes. Now, how these sex organs, they are present? Actually, we have to see the arrangement. Now, in the case of Riccia, these sex organs, they are scattered along midrib, but in Marchantia,"
  },
  {
    "start": 501.35,
    "end": 519.01,
    "text": "these sex organs, they are present over special stalked branches. Now, such type of branches, they are not seen in any member of bryophytes, so now these structures which we will be studying here, they are very peculiar. They are very different, unique."
  },
  {
    "start": 519.01,
    "end": 550.17,
    "text": "Now, majority of bryophytes, they are monoecious. When we say monoecious, it means that male and female sex organ, they are present in the same body. But there are few examples where dioecious condition is there, and one good example for this is Marchantia. You must not forget this. This is very important from examination point of view. So in Riccia, there is monoecious condition. However,"
  },
  {
    "start": 550.17,
    "end": 580.21,
    "text": "in Marchantia, there is dioecious condition. That is, male and female sex organ, they are present in the different plant body. Now, we are going to study sexual reproduction in bryophytes, in liverworts, by taking example of Marchantia. Just now, I have told you that they form sexual branches. Now, male branch is known as anthidiofore, and female branch is known as archegoniophores, or it may be also known"
  },
  {
    "start": 580.21,
    "end": 610.57,
    "text": "as carpophylum. Now, look at this male branch. Now, this is male thallus, and on the male thallus, can you see this branch? This is male branch, which is known as anthidiofore. It has two parts. This lower part is stalk. This upper part is disc. Disc is also known as receptacle, and it is the disc which contains sex organ, male sex organ, that is antheridia. So anthidiofore possess two structures, that is stalk and"
  },
  {
    "start": 610.57,
    "end": 640.69,
    "text": "receptacle. Now, receptacle has eight lobes. Eight lobes are there. Inside lobes, chambers are there. On the upper side, on the upper side, chambers are there, and inside the chambers, you will find male sex organs, that is antheridia. You know, throughout bryophyte sex organs, they are hidden, so here they are hidden inside the chambers. They are not visible. That's why you call bryophytes as cryptogams."
  },
  {
    "start": 640.75,
    "end": 670.75,
    "text": "Now, antheridia are formed by flagellated, curved, male gametes, motile male gametes, they are formed. Now let's talk about female structure. Yes, this is female thallus. Over female thallus, can you see this branch? This branch is known as archegoniophores. Now, if you look at male and female branch, they look identical, except one main difference, that in this female branch, you will see certain elongated structures along with lobes, and these"
  },
  {
    "start": 670.75,
    "end": 701.15,
    "text": "elongated structures, they are known as rays. So rays, they are features which differentiate male branch from female branch, right? So rays, they are only associated with thallus, with sexual branch of female. Now, again, it is divided into two parts. This lower part is stalk, upper part is disc or receptacle. Receptacle possess eight lobes, and along with that, nine rays are there. Now, these lobes"
  },
  {
    "start": 701.15,
    "end": 731.93,
    "text": "on the lower side, now please keep this in mind, that now female sex organs, they won't be present on the upper side, rather, they are present on the lower side, and these female sex organs, they are known as archegonia. Inside each archegonium, one female gamete is there, which is non-motile in nature. So oogamous type of sexual reproduction, where male gamete is motile and female gamete is non-motile, this is characteristic feature of all bryophytes."
  },
  {
    "start": 731.93,
    "end": 762.57,
    "text": "Now, by looking at this figure, can you tell that this thallus is of male or female? Yes, can you tell me? This is male or female branch. In this branch, you can easily view, you can see rays. If rays are present, so surely it is female thallus.... Now let's look at the closer view of this test to see where these sex organs, they are present. So actually, these are longitudinal vertical sections"
  },
  {
    "start": 762.57,
    "end": 792.83,
    "text": "of a disc of receptacle. Now, this is a section of male receptacle where you can see these club-like structures. These structures, they are in 3D here, and this is section of a female receptacle, and here you can see these flask-like structures. These are archegonia, but now you can see archegonia, they are not present on the upper side, rather, they are present on the lower side. Now, after fertilization, there will be formation of first cell of sporophytic"
  },
  {
    "start": 792.83,
    "end": 823.45,
    "text": "generation, that is zygote. So male and female gamete, they will fuse. After fusion, there is formation of zygote. Zygote is going to have two set of chromosome, one from the male gamete, another from the female gamete. So zygote is going to represent first diploid cell in the life cycle of bryophytes. Now, what is going to happen to this zygote? The zygote is going to multiply. Through mitotic division, it will form embryo."
  },
  {
    "start": 823.45,
    "end": 853.69,
    "text": "Now, embryo is going to develop into a diploid phase, which is known as sporophyte. Now, look at this sporophyte of Marchantia. It consists of three parts. Can you see these three parts? This is foot. Yes, this stalk-like structure is seta, and this structure is capsule. Foot, seta, capsule, these are three parts present in sporophyte of Marchantia. Now, in this"
  },
  {
    "start": 853.69,
    "end": 884.03,
    "text": "capsule, can you see two structures? These green color structures, which I have shown here, these are spores. These spores, they are formed after meiosis, so they are haploid in nature. Foot is part of sporophyte, it is diploid. Seta is also part of sporophyte, diploid. Capsule is also diploid, but inside capsule, spores, they are formed after meiosis. So spores, they are haploid in nature. So you can say that first cell, which is representative of haploid"
  },
  {
    "start": 884.03,
    "end": 915.01,
    "text": "generation or gametophytic generation, that is spore. Now, along with spore, can you see certain red color structures here? These red color elongated structures, which are present, they are known as elaters. Now, what is the function of elaters? They help in dehiscence of capsule, breakage of capsule, so that spores, they can be easily dispersed. So look at structure of one elator. Yes."
  },
  {
    "start": 915.01,
    "end": 945.09,
    "text": "Yes, this elongated structure is elator. Now, inside elator, you will see two bands. Two bands, they are present. This is one band, this is another band. Can you see that the two bands, they are spirally twisted? These spirally twisted bands, they are hygroscopic in nature. They have the ability to absorb water, and due to their hygroscopic nature, these elators, they show movement inside the capsule. Due to"
  },
  {
    "start": 945.09,
    "end": 975.35,
    "text": "their movement, this capsule wall break, and this will help in dehiscence of capsule. So function of elators is that they help in dehiscence of capsule, but you have to keep this in mind, that elators, they are not present in all members of liverworts. They are present in Marchantia, but they are absent in Riccia. So you have to keep this in mind. They are present in Marchantia, and another important example"
  },
  {
    "start": 975.35,
    "end": 1005.87,
    "text": "which you can write here, where elators they are present, that is Porella, right? So here we have learned that sporophyte, it consists of foot, seta, capsule, right? Now, this sporophyte, it is non-green. Now, the sporophyte is non-green, so it is dependent on gametophyte. Yes, it is dependent on gametophyte for food, water,"
  },
  {
    "start": 1005.87,
    "end": 1025.97,
    "text": "minerals, and attachment. It is dependent on gametophyte for all its requirement. That's why you are going to call this sporophyte as total parasite."
  },
  {
    "start": 1025.97,
    "end": 1055.97,
    "text": "Right. Now, this covering which you can see here, yes, this covering is not diploid. Yes, it is not diploid. It is not formed from sporophytic tissue. This covering is formed from ventral wall. You know that ventral is part of female sex organ, and female sex organ is present on haploid body that is gametophyte. So surely, this covering is also going to be haploid in nature. Now then, what is the function of this covering? This covering helps in protecting"
  },
  {
    "start": 1055.97,
    "end": 1086.55,
    "text": "sporophyte during its young stages. So this covering, which is formed from ventral wall, which is haploid in nature, you are going to call this covering as calyptra, right? So if you have to mention ploidy of different structure which are associated with this diagram, so you are going to say that calyptra is haploid. Yes, foot, it is part of sporophyte, it is diploid."
  },
  {
    "start": 1086.55,
    "end": 1116.59,
    "text": "Seta is also diploid. Capsule wall is diploid, but the spores which are present inside, they are formed after meiosis, so they are haploid in nature. Elators, yes, they are also part of sporophytic tissue, so they are also diploid, right? So this is all about important features with respect to liverworts. So let's take up one question here to know how much we have gained through this topic. Gemi are... Gemi, they are"
  },
  {
    "start": 1116.59,
    "end": 1146.63,
    "text": "asexual buds which are formed inside cups, which are known as gemma cups. They are unicellular structure, that's wrong. They are multicellular, multicelled, asexual buds. That's right. Diploid sporophytic structure? No, they are part of gametophytic body. Haploid sexual structures? They are haploid, but they are asexual structure, so the right answer to this question is option number two. Now, after liverworts, now"
  },
  {
    "start": 1146.63,
    "end": 1151.93,
    "text": "we are going to talk about leafy members of bryophytes, that is mosses."
  }
]